&НаСервереБезКонтекста
Процедура ЗарегистрироватьИзмененияНаСервере(Узел)
	// Регистрация изменений всех данных для узла.
	ПланыОбмена.ЗарегистрироватьИзменения(Узел);	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьИзменения(Команда)
	ЗарегистрироватьИзмененияНаСервере(Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка = ПланыОбмена.Филиалы.ЭтотУзел() Тогда
		Элементы.Главный.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры
