// Общий модуль: Пользователи
// Свойства: Сервер, Внешнее соединение, Вызов сервера, Клиент (обычное приложение)

#Область ПользователиИБ

Функция ТекущийПользователь() Экспорт
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь();
КонецФункции

Функция АвторизованныйПользователь() Экспорт
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь();
КонецФункции

Функция ЭтоАдминистратор(Пользователь = Неопределено) Экспорт
	Возврат ПравоДоступа("Администрирование", Метаданные);
КонецФункции

#КонецОбласти
