
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
//====================================================================
	     	Движения.Управленческий.Записывать = Истина;
//====================================================================
// Создать менеджер временных таблиц
МенеджерВТ = Новый МенеджерВременныхТаблиц;	
//====================================================================

#Область НоменклатураДокумента	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!


	Запрос = Новый Запрос;
//====================================================================
// Укажем, какой менеджер временных таблиц использует этот запрос
Запрос.МенеджерВременныхТаблиц = МенеджерВТ;	
//====================================================================
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходПроизводствоПереченьНоменклатуры.Номенклатура КАК Номенклатура,
		|	РасходПроизводствоПереченьНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|   		РасходПроизводствоПереченьНоменклатуры.НаборСвойств КАК НаборСвойств,
		|	СУММА(РасходПроизводствоПереченьНоменклатуры.Количество) КАК КоличествоВДокументе,
		|	СУММА(РасходПроизводствоПереченьНоменклатуры.Сумма) КАК СуммаВДокументе
//====================================================================		
		|ПОМЕСТИТЬ НоменклатураДокумента 
//====================================================================		
		|ИЗ
		|	Документ.РасходПроизводство.ПереченьНоменклатуры КАК РасходПроизводствоПереченьНоменклатуры
		|ГДЕ
		|	РасходПроизводствоПереченьНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходПроизводствоПереченьНоменклатуры.Номенклатура,
		|	РасходПроизводствоПереченьНоменклатуры.Номенклатура.ВидНоменклатуры,
		
		| 			РасходПроизводствоПереченьНоменклатуры.НаборСвойств";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();

#КонецОбласти
	
#Область НоменклатураДокумента
//====================================================================		
Запрос2 = Новый Запрос;
Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
Запрос2.Текст = "ВЫБРАТЬ
                |	НоменклатураДокумента.Номенклатура КАК Номенклатура,
                |	НоменклатураДокумента.ВидНоменклатуры КАК ВидНоменклатуры, 
				| 			НоменклатураДокумента.НаборСвойств КАК НаборСвойств,
                |	НоменклатураДокумента.КоличествоВДокументе КАК КоличествоВДокументе,
                |	НоменклатураДокумента.СуммаВДокументе КАК СуммаВДокументе,
                |	ЕСТЬNULL(СтоимостьМатериаловОстатки.СтоимостьОстаток, 0) КАК Стоимость,
                |	ЕСТЬNULL(ОстаткиМатериаловОстатки.КоличествоОстаток, 0) КАК Количество
                |ИЗ
                |	НоменклатураДокумента КАК НоменклатураДокумента
                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьМатериалов.Остатки(
                |				,
                |				Материал В
                |					(ВЫБРАТЬ
                |						НоменклатураДокумента.Номенклатура
                |					ИЗ
                |						НоменклатураДокумента)) КАК СтоимостьМатериаловОстатки
                |		ПО НоменклатураДокумента.Номенклатура = СтоимостьМатериаловОстатки.Материал
                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиМатериалов.Остатки(
                |				,
                |				Материал В
                |					(ВЫБРАТЬ
                |						НоменклатураДокумента.Номенклатура
                |					ИЗ
                |						НоменклатураДокумента)) КАК ОстаткиМатериаловОстатки
                |		ПО НоменклатураДокумента.Номенклатура = ОстаткиМатериаловОстатки.Материал";


// Установим необходимость блокировки данных в регистрах СтоимостьМатериалов
// и ОстаткиМатериалов
Движения.СтоимостьМатериалов.БлокироватьДляИзменения = Истина;
Движения.ОстаткиМатериалов.БлокироватьДляИзменения = Истина;

// Запишем пустые наборы записей, чтобы читать остатки без учета данных в документе
Движения.СтоимостьМатериалов.Записать();
Движения.ОстаткиМатериалов.Записать();


РезультатЗапроса = Запрос2.Выполнить();

//========= ТЗ = РезультатЗапроса.Выгрузить();

//====================================================================		
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//====================================================================		
		Если ВыборкаДетальныеЗаписи.Количество = 0 Тогда
СтоимостьМатериала = 0;
Иначе
СтоимостьМатериала = ВыборкаДетальныеЗаписи.Стоимость /
ВыборкаДетальныеЗаписи.Количество;
КонецЕсли;
//====================================================================		
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Если ВыборкаДетальныеЗаписи.Номенклатура.ВидНоменклатуры =
Перечисления.ВидыНоменклатуры.Материал Тогда
// Регистр ОстаткиМатериалов Расход
Движение = Движения.ОстаткиМатериалов.Добавить();
Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
Движение.Период = Дата;
Движение.Материал = ВыборкаДетальныеЗаписи.Номенклатура;
       // ============================================
       Движение.НаборСвойств = ВыборкаДетальныеЗаписи.НаборСвойств;
       // ============================================
Движение.Склад = Склад;
Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
// Регистр СтоимостьМатериалов Расход
Движение = Движения.СтоимостьМатериалов.Добавить();
Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
Движение.Период = Дата;
Движение.Материал = ВыборкаДетальныеЗаписи.Номенклатура;
Движение.Стоимость = ВыборкаДетальныеЗаписи.КоличествоВДокументе *
СтоимостьМатериала; 

//====================================================================	
		// Регистр Управленческий
		// Первая проводка: Д 62(ДебиторскаяЗадолженность) – К 90 (Капитал) Розничная сумма
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.ДебиторскаяЗадолженность;
		Движение.СчетКт = ПланыСчетов.Основной.Капитал;
		Движение.Период = Дата;
		Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаВДокументе;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договора] = Договор;
		// Вторая проводка: Д 90 (Капитал) – К 41 (Товары) – себестоимость
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.Капитал;
		Движение.СчетКт = ПланыСчетов.Основной.Товары;
		Движение.Период = Дата;
		Движение.Сумма = СтоимостьМатериала *
		ВыборкаДетальныеЗаписи.КоличествоВДокументе;
		Движение.КоличествоКт = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] =
		ВыборкаДетальныеЗаписи.Номенклатура;

//====================================================================	
                
		КонецЕсли;

	
		// ============================================ Регистр Продажи
Движение = Движения.Продажи.Добавить();
Движение.Период = Дата;
Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
Движение.Договор = Договор;
Движение.Исполнитель = Исполнитель;
Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
Движение.Выручка = ВыборкаДетальныеЗаписи.СуммаВДокументе;
Движение.Стоимость = СтоимостьМатериала * ВыборкаДетальныеЗаписи.КоличествоВДокументе;			
		 // ============================================ Регистр Продажи
	 
	КонецЦикла;

Движения.Записать();
#КонецОбласти

#Область КонтрольОстатков 

Если Режим = РежимПроведенияДокумента.Оперативный Тогда
// Проверить отрицательные остатки
Запрос3 = Новый Запрос;
Запрос3.МенеджерВременныхТаблиц = МенеджерВТ;
Запрос3.Текст = "ВЫБРАТЬ
                |	ОстаткиМатериаловОстатки.Материал КАК Материал,
				| 			ОстаткиМатериаловОстатки.НаборСвойств КАК НаборСвойств,
                |	ОстаткиМатериаловОстатки.КоличествоОстаток КАК КоличествоОстаток
                |ИЗ
                |	РегистрНакопления.ОстаткиМатериалов.Остатки(
                |			,
                |			(Материал , НаборСвойств) В
                |					(ВЫБРАТЬ
                |						НоменклатураДокумента.Номенклатура,
				|						НоменклатураДокумента.НаборСвойств
                |					ИЗ
                |						НоменклатураДокумента)
                |				И Склад = &Склад) КАК ОстаткиМатериаловОстатки
                |ГДЕ
                |	ОстаткиМатериаловОстатки.КоличествоОстаток < 0";


Запрос3.УстановитьПараметр("Склад", Склад);
РезультатЗапроса = Запрос3.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
Сообщение = Новый СообщениеПользователю();
Сообщение.Текст = "Не хватает " + Строка(- ВыборкаДетальныеЗаписи
.КоличествоОстаток) + " единиц материала """
+ ВыборкаДетальныеЗаписи.Материал + """"+
" из набора свойств """ + ВыборкаДетальныеЗаписи
.НаборСвойств + """";
Сообщение.Сообщить();
Отказ = Истина;
КонецЦикла;

КонецЕсли;	 
//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

#КонецОбласти	
	
	КонецПроцедуры

	
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
Префикс = Обмен.ПолучитьПрефиксНомера();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Договора") Тогда
		// Заполнение шапки
		Договор = ДанныеЗаполнения.Ссылка;
		
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
