
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументами.РасчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры  

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументами.РасчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры



&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	
	// Получить текущую строку табличной части.
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	// Установить цену.
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(
							Объект.Дата, СтрокаТабличнойЧасти.Материал);
	// Пересчитать сумму строки
	РаботаСДокументами.РасчитатьСумму(СтрокаТабличнойЧасти);

КонецПроцедуры






//============================================================================
//команда выбор номенклатуры из справочника Номенклатура в реквизит текущий реквизит Материал

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Материалы);
КонецПроцедуры


&НаКлиенте
Процедура МатериалыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Элементы.Материалы.ДобавитьСтроку();
	Элементы.Материалы.ТекущиеДанные.Материал = ВыбранноеЗначение;

	
//Множественный выбор выделение нескольких элементов (не работает цикл)	
//		Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
//			НоваяСтрока = Объект.Материалы.Добавить();
//			НоваяСтрока.Материал = ВыбранныйЭлемент;
//		КонецЦикла;


//============================================================================	
	//подстановка цены за единицу из регистра свдений Цены 
	
	// Получить текущую строку табличной части.
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	// Установить цену.
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(
							Объект.Дата, СтрокаТабличнойЧасти.Материал);
	// Пересчитать сумму строки
	РаботаСДокументами.РасчитатьСумму(СтрокаТабличнойЧасти);	
	
//============================================================================	
	
КонецПроцедуры


//============================================================================