// Общий модуль: ФайловаяСистема
// Свойства: Сервер, Внешнее соединение, Вызов сервера, Клиент (обычное приложение)

#Область РаботаСФайламиСервер

Функция ВременныйКаталог() Экспорт
	Возврат КаталогВременныхФайлов();
КонецФункции

Функция ИмяФайла(ПолноеИмяФайла) Экспорт
	Ф = Новый Файл(ПолноеИмяФайла);
	Возврат Ф.Имя;
КонецФункции

Функция ИмяФайлаБезРасширения(ПолноеИмяФайла) Экспорт
	Ф = Новый Файл(ПолноеИмяФайла);
	Возврат Ф.ИмяБезРасширения;
КонецФункции

Функция РасширениеФайла(ПолноеИмяФайла) Экспорт
	Ф = Новый Файл(ПолноеИмяФайла);
	Возврат Ф.Расширение;
КонецФункции

Функция ОбъединитьПути(Путь1, Путь2, Путь3 = "", Путь4 = "") Экспорт
	Возврат ФайловаяСистемаКлиентСервер.ОбъединитьПути(Путь1, Путь2, Путь3, Путь4);
КонецФункции

Функция ЭтоКорректноеИмяФайла(Знач ИмяФайла) Экспорт
	Возврат ФайловаяСистемаКлиентСервер.ЭтоКорректноеИмяФайла(ИмяФайла);
КонецФункции

Функция УдалитьНедопустимыеСимволыИмениФайла(Знач ИмяФайла, Знач СимволЗамены = "_") Экспорт
	Возврат ФайловаяСистемаКлиентСервер.УдалитьНедопустимыеСимволыИмениФайла(ИмяФайла, СимволЗамены);
КонецФункции

#КонецОбласти
